УчетВУправляющихДляГит1/src/AccumulationRegisters/ИППрочиеРасходы/ИППрочиеРасходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ИППрочиеРасходы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Корректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатурнаяГруппа</name>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактерДеятельности</name>
    <type>
      <types>EnumRef.ХарактерДеятельности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
      <types>CatalogRef.НематериальныеАктивы</types>
      <types>CatalogRef.ПрочиеДоходыИРасходы</types>
      <types>CatalogRef.РасходыБудущихПериодов</types>
      <types>CatalogRef.СтатьиЗатрат</types>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РасчетныйДокумент</name>
    <type>
      <types>DocumentRef.ОтчетПроизводстваЗаСмену</types>
      <types>DocumentRef.СписаниеОС</types>
      <types>DocumentRef.ОтражениеЗарплатыВБухучете</types>
      <types>DocumentRef.СписаниеСРасчетногоСчета</types>
      <types>DocumentRef.ПередачаОС</types>
      <types>DocumentRef.СписаниеТоваров</types>
      <types>DocumentRef.АвансовыйОтчет</types>
      <types>DocumentRef.ГТДИмпорт</types>
      <types>DocumentRef.ВыкупПредметовЛизинга</types>
      <types>DocumentRef.ОприходованиеТоваров</types>
      <types>DocumentRef.ВыдачаДенежныхДокументов</types>
      <types>DocumentRef.РегистрацияОплатыОсновныхСредствДляУСН</types>
      <types>DocumentRef.ДокументРасчетовСКонтрагентом</types>
      <types>DocumentRef.ПринятиеКУчетуОС</types>
      <types>DocumentRef.ПоступлениеНаРасчетныйСчет</types>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.ОперацияБух</types>
      <types>DocumentRef.УдалитьНачислениеЗарплатыРаботникамОрганизаций</types>
      <types>DocumentRef.ПерерасчетСтраховыхВзносов</types>
      <types>DocumentRef.АктОбОказанииПроизводственныхУслуг</types>
      <types>DocumentRef.ПоступлениеНМА</types>
      <types>DocumentRef.ОтражениеЗарплатыВУчете</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.ОказаниеУслуг</types>
      <types>DocumentRef.ВозвратТоваровОтПокупателя</types>
      <types>DocumentRef.Отпуск</types>
      <types>DocumentRef.ТребованиеНакладная</types>
      <types>DocumentRef.БольничныйЛист</types>
      <types>DocumentRef.ОтчетКомиссионераОПродажах</types>
      <types>DocumentRef.ОтчетКомитентуОПродажах</types>
      <types>DocumentRef.ПодготовкаКПередачеОС</types>
      <types>DocumentRef.АктПроверкиСтраховыхВзносов</types>
      <types>DocumentRef.ВводНачальныхОстатков</types>
      <types>DocumentRef.ПередачаОборудованияВМонтаж</types>
      <types>DocumentRef.ПередачаНМА</types>
      <types>DocumentRef.ОтчетОРозничныхПродажах</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      <types>DocumentRef.РасходыПредпринимателя</types>
      <types>DocumentRef.ПоступлениеИзПереработки</types>
      <types>DocumentRef.НачислениеЗарплаты</types>
      <types>DocumentRef.РегистрацияОплатыОсновныхСредствДляИП</types>
      <types>DocumentRef.УдалитьОтражениеЗарплатыВУчете</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ВозвратТоваровПоставщику</types>
      <types>DocumentRef.ИнвентаризацияНЗП</types>
      <types>DocumentRef.ПартияМатериаловВЭксплуатации</types>
      <types>DocumentRef.ИнвентаризацияТоваровНаСкладе</types>
      <types>DocumentRef.УдалитьРасчетЕСН</types>
      <types>DocumentRef.ВозвратМатериаловИзЭксплуатации</types>
      <types>DocumentRef.ПеремещениеОС</types>
      <types>DocumentRef.Партия</types>
      <types>DocumentRef.ПоступлениеДопРасходов</types>
      <types>DocumentRef.ПринятиеКУчетуНМА</types>
      <types>DocumentRef.СписаниеНМА</types>
      <types>DocumentRef.ПеремещениеТоваров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументОплаты</name>
    <type>
      <types>DocumentRef.СписаниеСРасчетногоСчета</types>
      <types>DocumentRef.АвансовыйОтчет</types>
      <types>DocumentRef.ВыдачаДенежныхДокументов</types>
      <types>DocumentRef.РегистрацияОплатыОсновныхСредствДляУСН</types>
      <types>DocumentRef.ДокументРасчетовСКонтрагентом</types>
      <types>DocumentRef.ПринятиеКУчетуОС</types>
      <types>DocumentRef.ПоступлениеНаРасчетныйСчет</types>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.ОперацияБух</types>
      <types>DocumentRef.КорректировкаДолга</types>
      <types>DocumentRef.МодернизацияОС</types>
      <types>DocumentRef.БольничныйЛист</types>
      <types>DocumentRef.ВводНачальныхОстатков</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      <types>DocumentRef.РасходыПредпринимателя</types>
      <types>DocumentRef.НачислениеЗарплаты</types>
      <types>DocumentRef.РегистрацияОплатыОсновныхСредствДляИП</types>
      <types>DocumentRef.Партия</types>
      <types>DocumentRef.ПринятиеКУчетуНМА</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УчетВУправляющихДляГит1/src/AccumulationRegisters/ИППрочиеРасходы/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

Процедура ЗаменитьСчетПФР_ОПС_ИП() Экспорт
	
	СчетУчетаУдаленный = ПланыСчетов.Хозрасчетный.УдалитьПФР_ОПС_ИП;
	СчетУчетаНовый     = ПланыСчетов.Хозрасчетный.ПФР_ОПС_ИП;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СчетУчетаУдаленный", СчетУчетаУдаленный);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИППрочиеРасходы.Регистратор
	|ИЗ
	|	РегистрНакопления.ИППрочиеРасходы КАК ИППрочиеРасходы
	|ГДЕ
	|	ИППрочиеРасходы.СчетУчета = &СчетУчетаУдаленный";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей = РегистрыНакопления.ИППрочиеРасходы.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Значение = Выборка.Регистратор;
		НаборЗаписей.Прочитать();
		
		Для Каждого Запись Из НаборЗаписей Цикл
			Если Запись.СчетУчета = СчетУчетаУдаленный Тогда
				Запись.СчетУчета = СчетУчетаНовый;
			КонецЕсли;
		КонецЦикла;
		
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли
